cmsis-svd/cmsis-svd/data/Fujitsu/MB9BF30xR.xml
        <!-- REGISTER "TIM2" -->
        <register derivedFrom="TIM0">
          <name>TIM2</name>
          <description>Timing Register 2</description>
          <addressOffset>0x28</addressOffset>
        </register>
        <!-- REGISTER "TIM3" -->
        <register derivedFrom="TIM0">
          <name>TIM3</name>
          <description>Timing Register 3</description>
          <addressOffset>0x2C</addressOffset>
        </register>
        <!-- REGISTER "TIM4" -->
        <register derivedFrom="TIM0">
          <name>TIM4</name>
          <description>Timing Register 4</description>
          <addressOffset>0x30</addressOffset>
        </register>
        <!-- REGISTER "TIM5" -->
        <register derivedFrom="TIM0">
          <name>TIM5</name>
          <description>Timing Register 5</description>
          <addressOffset>0x34</addressOffset>
        </register>
        <!-- REGISTER "TIM6" -->
        <register derivedFrom="TIM0">
          <name>TIM6</name>
          <description>Timing Register 6</description>
          <addressOffset>0x38</addressOffset>
        </register>
        <!-- REGISTER "TIM7" -->
        <register derivedFrom="TIM0">
          <name>TIM7</name>
          <description>Timing Register 7</description>
          <addressOffset>0x3C</addressOffset>
        </register>
        <!-- REGISTER "AREA0" -->
        <register>
          <name>AREA0</name>
          <description>Area Register 0</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000F0000</resetValue>
          <resetMask>0x007F00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MASK" -->
            <field>
              <name>MASK</name>
              <description>address mask</description>
              <lsb>16</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADDR" -->
            <field>
              <name>ADDR</name>
              <description>Address</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "AREA1" -->
        <register>
          <name>AREA1</name>
          <description>Area Register 1</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000F0010</resetValue>
          <resetMask>0x007F00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MASK" -->
            <field>
              <name>MASK</name>
              <description>address mask</description>
              <lsb>16</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADDR" -->
            <field>
              <name>ADDR</name>
              <description>Address</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "AREA2" -->
        <register>
          <name>AREA2</name>
          <description>Area Register 2</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000F0020</resetValue>
          <resetMask>0x007F00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MASK" -->
            <field>
              <name>MASK</name>
              <description>address mask</description>
              <lsb>16</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADDR" -->
            <field>
              <name>ADDR</name>
              <description>Address</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "AREA3" -->
        <register>
          <name>AREA3</name>
          <description>Area Register 3</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000F0030</resetValue>
          <resetMask>0x007F00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MASK" -->
            <field>
              <name>MASK</name>
              <description>address mask</description>
              <lsb>16</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADDR" -->
            <field>
              <name>ADDR</name>
              <description>Address</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "AREA4" -->
        <register>
          <name>AREA4</name>
          <description>Area Register 4</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000F0040</resetValue>
          <resetMask>0x007F00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MASK" -->
            <field>
              <name>MASK</name>
              <description>address mask</description>
              <lsb>16</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADDR" -->
            <field>
              <name>ADDR</name>
              <description>Address</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "AREA5" -->
        <register>
          <name>AREA5</name>
          <description>Area Register 5</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000F0050</resetValue>
          <resetMask>0x007F00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MASK" -->
            <field>
              <name>MASK</name>
              <description>address mask</description>
              <lsb>16</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADDR" -->
            <field>
              <name>ADDR</name>
              <description>Address</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "AREA6" -->
        <register>
          <name>AREA6</name>
          <description>Area Register 6</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000F0060</resetValue>
          <resetMask>0x007F00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MASK" -->
            <field>
              <name>MASK</name>
              <description>address mask</description>
              <lsb>16</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADDR" -->
            <field>
              <name>ADDR</name>
              <description>Address</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "AREA7" -->
        <register>
          <name>AREA7</name>
          <description>Area Register 7</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000F0070</resetValue>
          <resetMask>0x007F00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MASK" -->
            <field>
              <name>MASK</name>
              <description>address mask</description>
              <lsb>16</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADDR" -->
            <field>
              <name>ADDR</name>
              <description>Address</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
